## Terraform `Kubernetes`
  #### Format and Style 🖌`success`
  #### Initialization ⚙️`success`
  #### Validation 🤖`success`
  #### Plan 📖`skipped`
  #### Plan Request Change 📖`success`
  #### Apply 📖`success`

  <details><summary>Show Details</summary>

  ```terraform

  
data.terraform_remote_state.vpc: Reading...
module.kube.data.yandex_client_config.client: Reading...
module.kube.data.yandex_client_config.client: Read complete after 0s [id=1205372667]
data.terraform_remote_state.vpc: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kube.random_string.unique_id will be created
  + resource "random_string" "unique_id" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.kube.time_sleep.wait_for_iam will be created
  + resource "time_sleep" "wait_for_iam" {
      + create_duration = "5s"
      + id              = (known after apply)
    }

  # module.kube.yandex_iam_service_account.master[0] will be created
  + resource "yandex_iam_service_account" "master" {
      + created_at = (known after apply)
      + folder_id  = "b1gsjjo950i2c5fs82pe"
      + id         = (known after apply)
      + name       = (known after apply)
    }

  # module.kube.yandex_iam_service_account.node_account[0] will be created
  + resource "yandex_iam_service_account" "node_account" {
      + created_at = (known after apply)
      + folder_id  = "b1gsjjo950i2c5fs82pe"
      + id         = (known after apply)
      + name       = (known after apply)
    }

  # module.kube.yandex_kms_symmetric_key.kms_key[0] will be created
  + resource "yandex_kms_symmetric_key" "kms_key" {
      + created_at          = (known after apply)
      + default_algorithm   = "AES_256"
      + deletion_protection = false
      + description         = "K8S KMS symmetric key"
      + folder_id           = "b1gsjjo950i2c5fs82pe"
      + id                  = (known after apply)
      + name                = (known after apply)
      + rotated_at          = (known after apply)
      + rotation_period     = "8760h"
      + status              = (known after apply)
    }

  # module.kube.yandex_kms_symmetric_key_iam_binding.encrypter_decrypter[0] will be created
  + resource "yandex_kms_symmetric_key_iam_binding" "encrypter_decrypter" {
      + id               = (known after apply)
      + members          = (known after apply)
      + role             = "kms.keys.encrypterDecrypter"
      + symmetric_key_id = (known after apply)
    }

  # module.kube.yandex_kubernetes_cluster.kube_cluster will be created
  + resource "yandex_kubernetes_cluster" "kube_cluster" {
      + cluster_ipv4_range       = "172.17.0.0/16"
      + cluster_ipv6_range       = (known after apply)
      + created_at               = (known after apply)
      + description              = "Yandex Managed K8S cluster"
      + folder_id                = "b1gsjjo950i2c5fs82pe"
      + health                   = (known after apply)
      + id                       = (known after apply)
      + labels                   = (known after apply)
      + log_group_id             = (known after apply)
      + name                     = (known after apply)
      + network_id               = "enpb2dubbp3op4v647je"
      + network_policy_provider  = "CALICO"
      + node_ipv4_cidr_mask_size = 24
      + node_service_account_id  = (known after apply)
      + release_channel          = "REGULAR"
      + service_account_id       = (known after apply)
      + service_ipv4_range       = "172.18.0.0/16"
      + service_ipv6_range       = (known after apply)
      + status                   = (known after apply)

      + kms_provider (known after apply)

      + master {
          + cluster_ca_certificate = (known after apply)
          + etcd_cluster_size      = (known after apply)
          + external_v4_address    = (known after apply)
          + external_v4_endpoint   = (known after apply)
          + external_v6_endpoint   = (known after apply)
          + internal_v4_address    = (known after apply)
          + internal_v4_endpoint   = (known after apply)
          + public_ip              = true
          + security_group_ids     = (known after apply)
          + version                = (known after apply)
          + version_info           = (known after apply)

          + maintenance_policy {
              + auto_upgrade = true

              + maintenance_window {
                  + day        = "monday"
                  + duration   = "3h"
                  + start_time = "23:00"
                }
            }

          + master_location {
              + subnet_id = "e2ltb1e48n422kaji75o"
              + zone      = "ru-central1-b"
            }

          + master_logging {
              + audit_enabled              = true
              + cluster_autoscaler_enabled = true
              + enabled                    = true
              + events_enabled             = true
              + folder_id                  = "b1gsjjo950i2c5fs82pe"
              + kube_apiserver_enabled     = true
            }

          + regional (known after apply)

          + zonal (known after apply)
        }

      + timeouts {
          + create = "60m"
          + delete = "60m"
          + update = "60m"
        }
    }

  # module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"] will be created
  + resource "yandex_kubernetes_node_group" "kube_node_groups" {
      + cluster_id        = (known after apply)
      + created_at        = (known after apply)
      + description       = "Kubernetes nodes group 01"
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "yc-k8s-ng-01"
      + node_labels       = {
          + "environment" = "testing"
          + "role"        = "worker-01"
        }
      + status            = (known after apply)
      + version           = (known after apply)
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-b"
            }
        }

      + deploy_policy (known after apply)

      + instance_template {
          + metadata                  = {
              + "enable-oslogin" = "false"
            }
          + name                      = "{instance_group.id}-{instance.short_id}"
          + nat                       = (known after apply)
          + network_acceleration_type = "standard"
          + platform_id               = "standard-v3"

          + boot_disk {
              + size = 64
              + type = "network-hdd"
            }

          + container_network (known after apply)

          + container_runtime {
              + type = "containerd"
            }

          + gpu_settings (known after apply)

          + network_interface {
              + ipv4               = true
              + ipv6               = false
              + nat                = false
              + security_group_ids = (known after apply)
              + subnet_ids         = [
                  + "e2ltb1e48n422kaji75o",
                ]
            }

          + resources {
              + core_fraction = 50
              + cores         = 2
              + gpus          = 0
              + memory        = 2
            }

          + scheduling_policy {
              + preemptible = false
            }
        }

      + maintenance_policy {
          + auto_repair  = true
          + auto_upgrade = true

          + maintenance_window {
              + day        = "monday"
              + duration   = "3h"
              + start_time = "23:00"
            }
        }

      + scale_policy {
          + fixed_scale {
              + size = 1
            }
        }
    }

  # module.kube.yandex_resourcemanager_folder_iam_member.node_account[0] will be created
  + resource "yandex_resourcemanager_folder_iam_member" "node_account" {
      + folder_id = "b1gsjjo950i2c5fs82pe"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = "container-registry.images.puller"
    }

  # module.kube.yandex_resourcemanager_folder_iam_member.sa_calico_network_policy_role[0] will be created
  + resource "yandex_resourcemanager_folder_iam_member" "sa_calico_network_policy_role" {
      + folder_id = "b1gsjjo950i2c5fs82pe"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = "k8s.clusters.agent"
    }

  # module.kube.yandex_resourcemanager_folder_iam_member.sa_logging_writer_role[0] will be created
  + resource "yandex_resourcemanager_folder_iam_member" "sa_logging_writer_role" {
      + folder_id = "b1gsjjo950i2c5fs82pe"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = "logging.writer"
    }

  # module.kube.yandex_resourcemanager_folder_iam_member.sa_public_loadbalancers_role[0] will be created
  + resource "yandex_resourcemanager_folder_iam_member" "sa_public_loadbalancers_role" {
      + folder_id = "b1gsjjo950i2c5fs82pe"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = "load-balancer.admin"
    }

  # module.kube.yandex_vpc_security_group.k8s_main_sg[0] will be created
  + resource "yandex_vpc_security_group" "k8s_main_sg" {
      + created_at  = (known after apply)
      + description = "K8S security group"
      + folder_id   = "b1gsjjo950i2c5fs82pe"
      + id          = (known after apply)
      + labels      = (known after apply)
      + name        = (known after apply)
      + network_id  = "enpb2dubbp3op4v647je"
      + status      = (known after apply)

      + egress {
          + description       = "Rule allows master-node and node-node communication inside a security group."
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "self_security_group"
          + protocol          = "ANY"
          + to_port           = 65535
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
            # (1 unchanged attribute hidden)
        }
      + egress {
          + description       = "Rule allows pod-pod and service-service communication inside a security group. Indicate your IP ranges."
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ANY"
          + to_port           = 65535
          + v4_cidr_blocks    = [
              + "172.17.0.0/16",
              + "172.18.0.0/16",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }

      + ingress {
          + description       = "Rule allows availability checks from load balancer's address range. It is required for the operation of a fault-tolerant cluster and load balancer services."
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "loadbalancer_healthchecks"
          + protocol          = "TCP"
          + to_port           = 65535
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + description       = "Rule allows debugging ICMP packets from internal subnets."
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ICMP"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "10.0.0.0/8",
              + "172.16.0.0/12",
              + "192.168.0.0/16",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
      + ingress {
          + description       = "Rule allows master-node and node-node communication inside a security group."
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "self_security_group"
          + protocol          = "ANY"
          + to_port           = 65535
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + description       = "Rule allows pod-pod and service-service communication inside a security group. Indicate your IP ranges."
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ANY"
          + to_port           = 65535
          + v4_cidr_blocks    = [
              + "172.17.0.0/16",
              + "172.18.0.0/16",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
    }

  # module.kube.yandex_vpc_security_group.k8s_master_whitelist_sg[0] will be created
  + resource "yandex_vpc_security_group" "k8s_master_whitelist_sg" {
      + created_at  = (known after apply)
      + description = "Allow access to Kubernetes API from internet."
      + folder_id   = "b1gsjjo950i2c5fs82pe"
      + id          = (known after apply)
      + labels      = (known after apply)
      + name        = (known after apply)
      + network_id  = "enpb2dubbp3op4v647je"
      + status      = (known after apply)

      + egress (known after apply)

      + ingress {
          + description       = "Allow access to Kubernetes API via port 443 from subnet."
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = 443
          + protocol          = "TCP"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
      + ingress {
          + description       = "Allow access to Kubernetes API via port 6443 from subnet."
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = 6443
          + protocol          = "TCP"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
    }

  # module.kube.yandex_vpc_security_group.k8s_nodes will be created
  + resource "yandex_vpc_security_group" "k8s_nodes" {
      + created_at  = (known after apply)
      + description = "Security group rules for node groups"
      + folder_id   = "b1gsjjo950i2c5fs82pe"
      + id          = (known after apply)
      + labels      = (known after apply)
      + name        = (known after apply)
      + network_id  = "enpb2dubbp3op4v647je"
      + status      = (known after apply)

      + egress (known after apply)

      + ingress (known after apply)
    }

  # module.kube.yandex_vpc_security_group_rule.k8s_node_ports[0] will be created
  + resource "yandex_vpc_security_group_rule" "k8s_node_ports" {
      + description            = "Rule allows incoming traffic from the Internet to the NodePort port range. Add ports or change existing ones to the required ports."
      + direction              = "ingress"
      + from_port              = 30000
      + id                     = (known after apply)
      + labels                 = (known after apply)
      + port                   = -1
      + predefined_target      = (known after apply)
      + protocol               = "TCP"
      + security_group_binding = (known after apply)
      + security_group_id      = (known after apply)
      + to_port                = 32767
      + v4_cidr_blocks         = [
          + "0.0.0.0/0",
        ]
      + v6_cidr_blocks         = (known after apply)
    }

  # module.kube.yandex_vpc_security_group_rule.k8s_node_ssh_access_rule[0] will be created
  + resource "yandex_vpc_security_group_rule" "k8s_node_ssh_access_rule" {
      + description            = "Allow access to worker nodes via SSH from IP's."
      + direction              = "ingress"
      + from_port              = -1
      + id                     = (known after apply)
      + labels                 = (known after apply)
      + port                   = 22
      + predefined_target      = (known after apply)
      + protocol               = "TCP"
      + security_group_binding = (known after apply)
      + security_group_id      = (known after apply)
      + to_port                = -1
      + v4_cidr_blocks         = [
          + "0.0.0.0/0",
        ]
      + v6_cidr_blocks         = (known after apply)
    }

  # module.kube.yandex_vpc_security_group_rule.k8s_outgoing_traffic[0] will be created
  + resource "yandex_vpc_security_group_rule" "k8s_outgoing_traffic" {
      + description            = "Rule allows all outgoing traffic. Nodes can connect to Yandex Container Registry, Yandex Object Storage, Docker Hub, and so on."
      + direction              = "egress"
      + from_port              = 0
      + id                     = (known after apply)
      + labels                 = (known after apply)
      + port                   = -1
      + predefined_target      = (known after apply)
      + protocol               = "ANY"
      + security_group_binding = (known after apply)
      + security_group_id      = (known after apply)
      + to_port                = 65535
      + v4_cidr_blocks         = [
          + "0.0.0.0/0",
        ]
      + v6_cidr_blocks         = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_ca_certificate = (sensitive value)
  + cluster_id             = (known after apply)
  + external_v4_endpoint   = (sensitive value)
module.kube.random_string.unique_id: Creating...
module.kube.random_string.unique_id: Creation complete after 0s [id=gkcoq3jt]
module.kube.yandex_iam_service_account.node_account[0]: Creating...
module.kube.yandex_iam_service_account.master[0]: Creating...
module.kube.yandex_vpc_security_group.k8s_nodes: Creating...
module.kube.yandex_kms_symmetric_key.kms_key[0]: Creating...
module.kube.yandex_vpc_security_group.k8s_master_whitelist_sg[0]: Creating...
module.kube.yandex_vpc_security_group.k8s_main_sg[0]: Creating...
module.kube.yandex_kms_symmetric_key.kms_key[0]: Creation complete after 2s [id=abj8c5amom1lebvnnbs0]
module.kube.yandex_vpc_security_group.k8s_main_sg[0]: Creation complete after 3s [id=enpdudvnur3059fm2gi6]
module.kube.yandex_iam_service_account.master[0]: Creation complete after 4s [id=aje1u1ikqiqbub6etu0e]
module.kube.yandex_resourcemanager_folder_iam_member.sa_public_loadbalancers_role[0]: Creating...
module.kube.yandex_kms_symmetric_key_iam_binding.encrypter_decrypter[0]: Creating...
module.kube.yandex_resourcemanager_folder_iam_member.sa_calico_network_policy_role[0]: Creating...
module.kube.yandex_resourcemanager_folder_iam_member.sa_logging_writer_role[0]: Creating...
module.kube.yandex_vpc_security_group.k8s_master_whitelist_sg[0]: Creation complete after 4s [id=enp7jafnnldnc6p3tbgk]
module.kube.yandex_vpc_security_group.k8s_nodes: Creation complete after 5s [id=enpcka9qo5p4ncm1gclm]
module.kube.yandex_vpc_security_group_rule.k8s_node_ssh_access_rule[0]: Creating...
module.kube.yandex_vpc_security_group_rule.k8s_node_ports[0]: Creating...
module.kube.yandex_vpc_security_group_rule.k8s_outgoing_traffic[0]: Creating...
module.kube.yandex_iam_service_account.node_account[0]: Creation complete after 6s [id=ajevu18b1q2hrhi06gpd]
module.kube.yandex_resourcemanager_folder_iam_member.node_account[0]: Creating...
module.kube.yandex_vpc_security_group_rule.k8s_node_ports[0]: Creation complete after 2s [id=enpm71aj90l92qd7h436]
module.kube.yandex_resourcemanager_folder_iam_member.sa_public_loadbalancers_role[0]: Creation complete after 3s [id=b1gsjjo950i2c5fs82pe/load-balancer.admin/serviceAccount:aje1u1ikqiqbub6etu0e]
module.kube.yandex_vpc_security_group_rule.k8s_outgoing_traffic[0]: Creation complete after 2s [id=enprqqtpu66slq4l2e7l]
module.kube.yandex_vpc_security_group_rule.k8s_node_ssh_access_rule[0]: Creation complete after 3s [id=enpm3p44ka7a5hnobif4]
module.kube.yandex_kms_symmetric_key_iam_binding.encrypter_decrypter[0]: Creation complete after 4s [id=abj8c5amom1lebvnnbs0/kms.keys.encrypterDecrypter]
module.kube.yandex_resourcemanager_folder_iam_member.sa_logging_writer_role[0]: Creation complete after 6s [id=b1gsjjo950i2c5fs82pe/logging.writer/serviceAccount:aje1u1ikqiqbub6etu0e]
module.kube.yandex_resourcemanager_folder_iam_member.sa_calico_network_policy_role[0]: Creation complete after 9s [id=b1gsjjo950i2c5fs82pe/k8s.clusters.agent/serviceAccount:aje1u1ikqiqbub6etu0e]
module.kube.yandex_resourcemanager_folder_iam_member.node_account[0]: Creation complete after 10s [id=b1gsjjo950i2c5fs82pe/container-registry.images.puller/serviceAccount:ajevu18b1q2hrhi06gpd]
module.kube.time_sleep.wait_for_iam: Creating...
module.kube.time_sleep.wait_for_iam: Creation complete after 5s [id=2025-04-27T23:14:42Z]
module.kube.yandex_kubernetes_cluster.kube_cluster: Creating...
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [20s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [30s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [40s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [50s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [1m0s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [1m10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [1m20s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [1m30s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [1m40s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [1m50s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [2m0s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [2m10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [2m20s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [2m30s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [2m40s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [2m50s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [3m0s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [3m10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [3m20s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [3m30s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [3m40s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [3m50s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [4m0s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [4m10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [4m20s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [4m30s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [4m40s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [4m50s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [5m0s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [5m10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [5m20s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [5m30s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [5m40s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [5m50s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [6m0s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [6m10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [6m20s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [6m30s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [6m40s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [6m50s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [7m0s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [7m10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Creation complete after 7m13s [id=catfga8hraal02m3rthh]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Creating...
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [11s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [21s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [31s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [41s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [51s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [1m1s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [1m11s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [1m21s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [1m31s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Creation complete after 1m36s [id=cat8a6c03mdtti4fbsrd]

Apply complete! Resources: 18 added, 0 changed, 0 destroyed.

Outputs:

cluster_ca_certificate = <sensitive>
cluster_id = "catfga8hraal02m3rthh"
external_v4_endpoint = <sensitive>


  ```

  </details>
  
  Results for commit: 

  *Pusher: @ptishkin, Action: `workflow_dispatch`, Working Directory: `kube`, Workflow: `Terraform CI/CD`*